core/src/test/resources/sampleSoapService/wrongRequest.xml

<s:Envelope xmlns:s="http://schemas.xmlsoap.org/soap/envelope/" xmlns:cs="https://predic8.de/city-service">
    <s:Body>
        <cs:getCityDetails>
            <ccity>Bonn</ccity>
        </cs:getCityDetails>
    </s:Body>
</s:Envelope>